# MinRunWidth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsType..::..MinRunWidth Property
StairsType Class See Also
---
The initial value for the width of a common run.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double MinRunWidth { get; set; }
```

Visual Basic
---
```text
Public Property MinRunWidth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MinRunWidth {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for minRunWidth must be greater than 0 and no more than 30000 feet. |

# See Also
StairsType Class
Autodesk.Revit.DB.Architecture Namespace